import { Burger } from './burger.interface';

export const burgers: Burger[] = [
  {
    image: 'burger1.png',
    name: 'Бургер чеддер & бекон',
    composition:
      'Котлета из говядины криспи, булочка, томат, сыр Чеддер, грудинка, лук красный, салат айсбер, майонез, кетчуп, сырный соус',
    price: '8',
    weight: '360',
  },
  {
    image: 'burger2.png',
    name: 'BBQ с беконом и курицей',
    composition:
      'Булочка бриошь с кунжутом, куриная котлета, сыр чеддер, томат, огурец маринованный, лук маринованный, салат Ромен, бекон, соус BBQ',
    price: '7',
    weight: '390',
  },
  {
    image: 'burger3.png',
    name: 'Дабл биф бургер',
    composition:
      'Две говяжьи котлеты, сыр чеддер, салат романо, маринованные огурцы, свежий томат, бекон, красный лук, соус бургер, горчица',
    price: '10',
    weight: '420',
  },
  {
    image: 'burger4.png',
    name: 'Баварский бургер',
    composition:
      'Булочка для бургера, говяжья котлета, красный лук, сыр, охотничья колбаска, соус барбекю, соус сырный, салат айсберг',
    price: '7',
    weight: '220',
  },
  {
    image: 'burger5.png',
    name: 'Бекон чизбургер',
    composition:
      'Булочка для бургера, говяжья котлета, грудинка, помидор, огурец маринованный, сыр, сырный соус, кетчуп, зелень',
    price: '8',
    weight: '220',
  },
  {
    image: 'burger6.png',
    name: 'Индиана бургер',
    composition:
      'Булочка для бургера, котлета куриная, грудинка, яйцо, огурец маринованный, криспи лук, кетчуп, соус сырный, горчица, зелень',
    price: '9',
    weight: '320',
  },
];
